# 基本功能

pandas中的对象包含多种方法。

首先导入pandas相关的模块。

In [3]:
import pandas as pd
import numpy as np

## reindex

pandas中的数据结构具有的一个重要方法即`reindex`，该方法会接受一个`list`作为参数，用于创建一个与原对象相同的新对象，并将新对象的`index`设置为给定的`list`参数，

In [4]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

`reindex`的`method`属性为`ffill`时，指定了对有序`index`列表中缺省项采用依次填补的方式补充完整。若不指定`method`属性，则新对象的`index`列表的缺省向为`NaN`。

In [5]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [6]:
obj3.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

对于`DataFrame`类型，`reindex`方法可以更改`index`、`columns`，或者两者同时修改。

我们还可以通过`loc`方法替代`reindex`方法，更加简洁的完成同样的功能**（官方已经不推荐这一做法，该方法存在安全隐患）**。

In [7]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'], 
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [8]:
states = ['Texas', 'Utah', 'California']
frame2 = frame.reindex(['a', 'b', 'c', 'd'], columns=states)
frame2

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

|参数|备注|
|-|-|
|index||
|method||
|fill_value||
|limit||
|tolerance||
|level||
|copy||

## drop

对于`Series`对象，`drop`方法会删除对象中一行或多行，并返回一个删除行后的新对象，原对象不受影响。

In [9]:
# 删除单行
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [10]:
# 删除多行
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

对于`DataFrame`对象，`drop`方法既可以根据`index`删除行，也可以根据`columns`删除列。在未指定`axis`值时，`drop`方法行为与`Series`对象中类似，默认删除`DataFrame`对象的行，当`axis`值为`1`或`columns`时，`drop`删除`DataFrame`的指定列。

In [11]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [12]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [13]:
data.drop('two', axis='columns')

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

当指定`inplace`为`True`时，`DataFrame`将删除原对象的对应行与列。

In [14]:
obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

## 索引、选择、筛选

`Sereis`对象的索引（`obj[...]`）与NumPy数组类似。

### 索引

In [15]:
obj = pd.Series(np.arange(4.0), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [16]:
obj['b']

1.0

In [17]:
obj[1]

1.0

In [18]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [19]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [20]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [21]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [22]:
# 赋值
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

对于`DataFrame`，`[]`可以返回`DataFrame`对象的一列或多列。

In [23]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [24]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [25]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [26]:
# 返回行，这是一种简化了的写法，需要重点注意
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [27]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

根据筛选条件返回`DataFrame`对应布尔值矩阵。

In [28]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [29]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### loc与iloc

对于`DataFrame`的行索引标签，可以使用`loc`和`iloc`操作符，用于选择`DataFrame`对象行与列的子集。

`loc`操作符接受行列`index`或`columns`标签值作为参数，`iloc`操作符接受行与列的计数值作为参数。

    loc[row_label, column_label]
    iloc[row_index, column_index]
    at[row_label, column_label]
    iat[row_index, column_index]

In [30]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [31]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [32]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [33]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [34]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [35]:
# slice
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [36]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

## 整数索引

当`Series`或`DataFrame`中的`index`或`columns`以给定的索引值为整数时，在数据选择时会出现歧义。

In [37]:
ser = pd.Series(np.arange(3.0))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [38]:
ser2 = pd.Series(np.arange(3.0), index=['a', 'b', 'c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [39]:
# 对以整数作为index的Series存在歧义，出现错误
# ser[-1]

# 对以非整数作为index的Series不存在歧义
ser2[-1]

2.0

当`Series`的索引为整数时，为保证索引行为的一致性，若使用整数作为`index`或`columns`，则数据选择以索引值为准

其中`loc`针对索引标签选择操作，而`iloc`针对整数索引选择操作。

In [40]:
ser[:1]

0    0.0
dtype: float64

In [41]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [42]:
ser.iloc[:1]

0    0.0
dtype: float64

## 数据计算与数据对齐

### Series对象

In [43]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [44]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [45]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

### DataFrame

In [46]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [47]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [48]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

对没有相同行列索引的`DataFrame`求和操作，结果`DataFrame`各元素均为`NaN`。

In [49]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

### 数据计算中的空值填充

In [50]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [51]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [52]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

算数运算方法如下表所示：

|方法|备注|
|-|-|
|add/rdd|+|
|sub/rsub|-|
|div/rdiv|/|
|floordiv/rloordiv|//|
|mul/rmul|\*|
|pow/rpow|\*\*|

### DataFrame与Series之间的操作

NumPy的`array`具有广播这一特性。
// TODO 广播

In [53]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [54]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [55]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

`DataFrame`与`Series`之间的运算操作与NumPy中的广播类似。

In [56]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [57]:
# frame的第一行
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [58]:
# frame中的每一行依次与series进行计算
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [59]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

`DataFrame`的列与`Series`同样支持类似的特性。

In [60]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [61]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [62]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

## 函数与映射

NumPy中的element-wise函数对pandas中的对象仍然适用。

In [63]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame
frame.apply(lambda x: x - 10)

                b          d          e
Utah    -8.982303 -10.549175 -10.379357
Ohio    -9.613027  -9.282964  -8.855292
Texas   -9.657709 -11.068744  -9.170989
Oregon -12.424862 -12.659181  -8.996751

In [64]:
np.abs(frame)

               b         d         e
Utah    1.017697  0.549175  0.379357
Ohio    0.386973  0.717036  1.144708
Texas   0.342291  1.068744  0.829011
Oregon  2.424862  2.659181  1.003249

同样的，接受一个一维数组作为参数的函数同样可以依次将pandas中对象的行或列作为参数。

In [65]:
# 默认依次对每一列调用一次函数
f = lambda x: x.max() - x.min()
frame.apply(f)

b    3.442559
d    3.376218
e    1.524065
dtype: float64

In [66]:
# 依次对每一行调用依次函数
frame.apply(f, axis='columns')

Utah      1.566872
Ohio      0.757735
Texas     1.897756
Oregon    3.662430
dtype: float64

`apply`函数返回的结果也可以是一个`Sreies`对象。

In [67]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -2.424862 -2.659181 -0.379357
max  1.017697  0.717036  1.144708

python中的element-wise函数对pandas中的对象同样适用。

In [68]:
ff = lambda x: '%.2f' % x
frame.applymap(ff)

            b      d      e
Utah     1.02  -0.55  -0.38
Ohio     0.39   0.72   1.14
Texas    0.34  -1.07   0.83
Oregon  -2.42  -2.66   1.00

In [69]:
frame['e'].map(ff)

Utah      -0.38
Ohio       1.14
Texas      0.83
Oregon     1.00
Name: e, dtype: object

array-wise函数调用

- `Series.apply(func)`：将`Series`作为`func`的参数并调用函数`func`后返回结果。
- `DataFrame.apply(func)`：依次将`DataFrame`的每一行或列作为`func`的参数并调用函数`func`。

element-wise函数调用

- `Series.map(func)`：依次将`Series`的每一个元素作为`func`的参数并调用函数`func`。
- `DataFrame.applymap(func)`：依次将`DataFrame`的每一个元素作为`func`的参数并调用函数`func`。

## 排序与rank

### 排序

pandas的`sort_index`方法基于`Series`对象或`DataFrame`对象的索引进行排序。

In [70]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [71]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [72]:
# 默认对index排序
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [73]:
# 对columns排序
frame.sort_index(axis='columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

指定排序顺序为升序或降序。

In [74]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

`sort_values`函数可根据`Series`的元素值进行排序，其中的空值元素将被放在排序的末尾。

In [75]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

`sort_values`函数也可根据`DataFrame`的一列或多列的元素值进行排序。

In [76]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [77]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [79]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

### ranking

`rank`函数可以返回数组中各元素在所有元素中的排序位置索引，对数组中的重复元素，默认返回的其平均rank值，可以通过`method`属性设置rank方式。

In [80]:
# 默认返回分组的平均rank值
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [106]:
# 相同元素的分组以其在数组中出现的先后顺序排序
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [107]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

`rank`函数对`DataFrame`同样适用，通过`axis`属性确定对行或列进行排序。

In [108]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 
                      'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [109]:
frame.rank(axis='columns')

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

## 索引中重复值

pandas中对象的索引允许重复包含重复值。

In [110]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [111]:
obj.index.is_unique

False

在通过`[]`对一个`Series`对象进行数据选择时，对于对应多个值的索引，数据选择返回的是一个包含多个值的`Series`对象，这与选择唯一索引返回单个元素值是不同的。

In [112]:
obj['a']

a    0
a    1
dtype: int64

In [113]:
obj['c']

4

对于`DataFrame`，对于对应多个值的索引，数据选择返回是同样是一个`DataFrame`子集。

In [114]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.658943  0.415711 -2.314507
a  1.028119  1.548432 -1.648381
b  0.736758  0.457261 -1.811809
b -0.093158 -1.199838  0.154476

In [115]:
df.loc['b']

          0         1         2
b  0.736758  0.457261 -1.811809
b -0.093158 -1.199838  0.154476